[
    "There are almost 400 different kinds of ladybugs in North America",
    "A ladybug's jaws chew from side to side instead of up and down like our jaws",
    "The color of a ladybug's spots begin to fade as it gets older",
    "Ladybugs are most active when their body temperature is 75 degrees or warmer",
    "Not all ladybugs are red with black spots",
    "Ladybugs may eat 5,000 aphids across its lifetime",
    "The spots and bright colors on ladybugs are not for looks alone",
    "The spots are meant to warn would-be attackers that this beetle tastes terrible",
    "Ladybugs emit foul-smelling blood from their leg joints when they're startled",
    "When all else fails, ladybugs are known to play dead, giving them a third defense mechanism in a world of eat or be eaten",
    "Legend has it farmers prayed to Virgin Mary for help when aphids were destroying their crops. Ladybugs arrived, ate all the aphids and saved the day. The farmers from then on referred to them as \"Our Lady's beetles.\"",
    "Ladybugs may eat their own eggs",
    "Female ladybugs lay as many as 1,000 tiny gold-colored eggs during a single season, but not all of the eggs make it to adulthood",
    "While they prefer to lay their eggs on leaves covered with aphids, when prey is in short supply, the ladybugs may eat the eggs and larvae",
    "Ladybugs have hidden wings underneath their outer shell",
    "Much like butterflies, ladybugs go through four stages before they complete their metamorphosis",
    "Ladybugs begin as tiny eggs that hatch into larvae that resemble tiny spiny alligators",
    "Adult ladybugs have a recognizable smooth dome shape, and their forewings are protected by an outer shell, or elytra",
    "Underneath the outer shell of a ladybug is a pair of thin hind wings that unfold at a speed of 0.1 seconds and are significantly larger than the ladybug's body",
    "Once unfolded, ladybug wings move at a rate of 85 beats per second",
    "In an effort to track ladybug populations, entomologists at Cornell University created the Lost Ladybug Project, a citizen-based effort to spot, photograph, and report on ladybugs across North America",
    "Ladybugs cluster together as a way to deter predators by increasing the concentration of their smell and their warning coloration.",
    "Ladybugs are both male and female. There are no gentleman bugs :P",
    "There are two sets of wings. The outer set is the hard shell for protection, and the inner set are what it uses to fly",
    "Ladybugs are very helpful to a garden as they eat aphids and mites, which are bugs that are harmful to plants",
    "An adult ladybug can eat up to 50 aphids in a day",
    "As larvae, ladybugs resemble tiny black alligators",
    "The larva sheds its outer skin, which is called molting. This happens after it has eaten too much that it's skin becomes too tight",
    "After the larva is done molting, it becomes a pupa",
    "The pupa sticks itself to a safe place where it will not move. The pupa breaks open as the ladybug comes out",
    "The ladybug's body goes from being soft with no spots to the hardened and spotted ladybugs we are familiar with",
    "The inner wings used for flying must dry before the ladybug can fly",
    "Germans call ladybugs Marienkäfers, or Mary’s beetles",
    "One of the most common European ladybugs is the seven-spot ladybug, and its seven marks reminded people of the Virgin Mary's seven sorrows",
    "One of the primary differences between beetles and bugs is that beetles have chewing mouthparts, but bugs have mouthparts modified into a piercing stylet like a needle",
    "In parts of England, the ladybug is a bishop. Local variants of this name abound, including the amazing bishy bishy barnabee",
    "In several languages, the portly, spotted ladybug is affectionately known as a little cow",
    "French people sometimes use the term vache à Dieu for a ladybug, which means \"cow of God.\"",
    "The English once called it a ladycow before they switched to bishop and ladybird.",
    "Among the spotted ladybugs, the number of spots varies",
    "The twice-stabbed ladybug is black with just two bright red dots",
    "On the other hand, the yellow twenty-two spot ladybug has, well, 22 of them",
    "The harlequin ladybug can be yellow, red, black, and almost any combination thereof, and it has any number of spots, from zero to 22",
    "Ladybugs with bright colors are walking billboards that say, \"Don't eat me. I'll make you sick.\"",
    "Ladybugs won't harm you unless you eat many pounds of them (or in the rare case that you're allergic to them)",
    "Though ladybug larvae may be intimidating, they're not harmful to humans",
    "Ladybug pupae look like aliens",
    "In winter, ladybugs enter a state of rest and cuddle together in groups, often in logs or under leaves",
    "In winter, Harlequin Ladybugs gather in huge numbers and settle into dark crevices in a house",
    "Ladybugs squirt out a noxious defensive liquid that can stain light surfaces",
    "Ladybugs are universally beloved, and one reason is that they're a natural and adorable form of pest control",
    "In additiona to aphids, many ladybugs supplement their diets with pollen and other plant foods",
    "Some ladybugs eat vegetation and fungi exclusively",
    "The Mexican bean beetle dines on beans, and the squash beetle eats squash, cantaloupe, and pumpkin",
    "Ladybugs have turned up in parts of the world where they weren't previously found",
    "Ladybugs were brought over by people to combat agricultural pests",
    "Ladybugs have \"hitchhiked\" on imported goods to parts of the world where they weren't previously found",
    "The Harlequin Ladybug, an invader species, pushes out native species, infects them with a deadly fungal parasite, and even eats them",
    "Winemakers face a bizzare problem called Ladybug Taint. Ladybugs crawling on grapes squirt out a smelly defensive liquid during grape harvest if they're frightened",
    "Ladybug taint is a particular stinky flavor to wine, that has been likened to peanuts or asparagus",
    "Some ladybugs have white spots and some even have stripes",
    "Most known ladybug is the red one with 7 spots however other species can have different numbers of spots",
    "On average a ladybug lifespan is one year long",
    "Some ladybugs have exotic colors as dark blue and orange",
    "Some species of ladybug are spotted, others have stripes, and still others sport a checked pattern",
    "There are 5,000 different species of ladybugs, 450 of which live in North America",
    "You can tell where a ladybug lives based on its color patterns",
    "Some species of ladybugs change color throughout the year",
    "Specialist ladybugs use a camouflage coloration to match the vegetation when they're in hibernation",
    "Insect-eating birds and other animals learn to avoid meals that come in red and black and are more likely to steer clear of a ladybug lunch",
    "Ladybugs eat a tremendous amount of insects",
    "The North American ladybug is not endangered yet, but its overall numbers have decreased, and some scientists believe that is the result of harlequin competition",
    "Because they blend in with the fruit, the ladybug gets harvested with the crop, and if the winemakers don't get rid of the ladybugs, the nasty taste of the \"knee bleed\" will taint the vintage",
    "Sometimes masses of ladybugs wash up on shores",
    "Near large bodies of water all over the world, massive numbers of ladybugs, dead and alive, occasionally or regularly appear on the shorelines",
    "The largest washup of ladybugs on a shore to date happened in the early 1940s when an estimated 4.5 billion individuals were spread over 21 kilometers of shoreline in Libya",
    "It's not understood by the scientific community why ladybugs washup on shores",
    "Ladybugs practice cannibalism",
    "A hungry ladybug will make a meal of any soft-bodied sibling it encounters",
    "Newly emerged adults or recently molted larvae are soft enough for the average ladybug to chew",
    "Scientists believe that ladybugs will deliberately lay infertile eggs as a ready source of food for their young hatchlings",
    "When times are tough, a ladybug may lay an increased number of infertile eggs to give her babies a better chance of surviving",
    "Ladybugs range in size from 0.8 to 18 millimeters (0.0315 to 0.708 inches)",
    "The six short little legs of a ladybug help it to walk, but they do more than that. The feet of a ladybug helps it smell.",
    "Ladybugs have two pairs of wings, but only one pair is used to fly. The front wings are strong and protect the back wings. A ladybug's rear or back wings are its flying wings",
    "A ladybug beats its wings about 5100 times a minute or about 85 beats a second when it flies",
    "Scientists used to believe that anything over 2 meters (7 feet) was a long-distance flight for a ladybug",
    "New data shows ladybugs can travel up to 120 kilometers (74 miles) in a single flight",
    "A detailed study has shown ladybugs travelling at heights in excess of 1,100 meters (3,600 feet) and reaching speeds of 60 kilometers per hour (37 mile per hour)",
    "As cold-blooded species, ladybugs mainly are diurnal, utilizing as much sunlight as possible for feeding and mating",
    "Ladybug communicate with each other mainly through chemical signals (pheremones)",
    "Birds are ladybugs' main predators, but they also fall victim to frogs, wasps, spiders, and dragonflies",
    "Four stages exist in the ladybug life cycle, a process known as complete metamorphosis",
    "A common myth is that the number of spots on the insect's back indicates its age",
    "Many cultures consider ladybugs lucky and have nursery rhymes or local names for the insects that reflect this",
    "Ladybugs are, and have been for very many years, an insect of interest and favour for children",
    "NASA sent a few ladybugs into space with aphids to see how aphids would escape in zero gravity",
    "Ladybugs are the official state insect of the following states in USA - Delaware, Massachusetts, New Hampshire, New York, Ohio and Tennessee",
    "The bold colors and simple shapes of a ladybug are used as a logo for a wide range of organisations and companies",
    "The scientific name for ladybug Coccinellidae septempunctata means \"seven spot ladybug\"",
    "Ladybugs grow up to one centimetre long",
    "The maximum lifespan of a ladybug is two years",
    "A ladybug will lay eggs in rows or clusters underneath a leaf",
    "Ladybug eyes are called compound eyes. They can see in lots of different directions at once",
    "Most ladybugs are oval shaped",
    "The seven spotted ladybug has a black head with white spots on the side",
    "Yellow ladybugs are not all one species. You can tell the different types of yellow ladybug by the pattern of black spots on them",
    "The ladybug habitat is forests and grasslands, as well as in cities and suburbs, and near to rivers",
    "Ladybugs live almost all over the world, except from in the north and south pole and the top part of North America and Russia where it is very cold",
    "In most cultures a ladybug is known as a symbol of good luck",
    "The twice stabbed ladybug is black and has two big red spots",
    "Ladybugs have an exoskeleton made of a protein like the one that forms our hair and fingernails",
    "Ladybugs have two pairs of wings. The first pair of wings is the hardened elytra that protect the flight wings underneath",
    "When the ladybug takes flight, the hardened outer elytra open, and the thin inner veined wings unfold",
    "Ladybugs gather together in large groups to diapause (the insect term for hibernation)",
    "Millions of ladybugs gather in the southwestern United States, where they cover the ground like a blanket of red and black",
    "Ladybugs can survive for up to nine months by living off their stored reserves",
    "In England, finding a ladybug means there will be a good harvest",
    "In Sweden, if a ladybug lands on a young girl's hand, she will soon be getting married",
    "Once ladybug eggs hatch, the larvae eat about 350 to 400 aphids in the 2 weeks it takes them to become fully grown",
    "As they grow, the larvae shed their skin several times",
    "Once they are a certain size, the larvae of ladybugs stop eating and attach themselves to a plant leaf or stem",
    "In the pupa stage of a ladybug's metamorphosis, they attach themselves to a plant leaf or stem",
    "A ladybug's entire life cycle only takes three to seven weeks",
    "Ladybug populations are stable. Stable population refers to a population with an unchanging but possibly nonzero rate of growth",
    "Ladybugs mature from their larval form to adults in about a week",
    "In 1999, four appropriately named ladybugs, John, Paul, Ringo, and George (after The Beatles of course) went to space",
    "Four ladybugs were brought to space with aphids, so scientists could observe how predators and their prey would interact in zero gravity",
    "Of the more than 6000 species of ladybug found on Earth, 166 of them are found in Canada, and more than 70 are found in Ontario",
    "In Canada, a ladybug spending the winter in your garage is a sign of good luck for the garage owner and their family",
    "Unlike you and I who chew up and down, ladybugs chew by moving their jaws side to side",
    "Orange and blue ladybugs are more exotic",
    "In 1888, an Australian ladybug was imported in California for a pest control experiment. The experiment helped triple California's orange crop",
    "In 2017, a film entitled Lady Bird starring Saoirse Ronan and directed by Greta Gerwig released in U.S. cinemas",
    "Former first of USA Lady Claudia Johnson, former president Lyndon B. Johnson's wife, is better known by her nickname \"Lady Bird\" Johnson",
    "Ladybugs breathe through openings located at the sides of their bodies",
    "If you hold a Ladybug while making a wish, the direction that it flies away indicates where the answer to your wish will come from",
    "In folk medicine, Ladybugs were ground up to cure toothaches, measles, stomach aches, and crying babies",
    "In Switzerland, the Ladybug is the baby-deliverer (just as the stork is in the US)",
    "Certain Asian cultures believe that Ladybugs can understand human languages",
    "In Belgium, it was believed that if a Ladybug crawled across a young woman's hand, she would be married within a year",
    "People believed that if a Ladybug with less than seven spots was seen, the harvest would be good for that season; if it had more than seven, there would be famine",
    "In Norway, if a man and a woman see a Ladybug at the same time, romance will blossom between them",
    "A Norse legend states that the Ladybug came to Earth riding on a bolt of lightening",
    "Legend says that if you find a Ladybug in your house, count the number of spots it has and that will be how many dollars you will find",
    "People in France believed that if a Ladybug landed on someone, it would take away whatever ailment the person had when it flew away",
    "The number of spots seen on a Ladybug indicates how many months it will be before one finds romance",
    "In Ireland, the ladybug is said to be a symbol of protection",
    "Male ladybugs are typically smaller in size compared to the female",
    "Male ladybugs have hair on their abdomens and bands in between their segments",
    "Ladybugs are a part of the largest group of pollinators",
    "For some species of ladybugs, their diet consists of 50% pollen",
    "The species of ladybugs that eat pollen make sure there is enough left to pollinate the flower after it's done eating",
    "You can buy ladybugs like many gardeners do. Or you can mint a crypto-bug ! :)",
    "The Grouchy Ladybug is a children's book about an ill-mannered ladybug who thinks she's better than everybody",
    "Ladybugs break out of diapause, the insect term for hibernation, when the temperature reaches 55° F (13° C)",
    "Despite its name, there are both male and female ladybugs",
    "Ladybugs' numbers are declining. :( Some reasons are climate change, land-use changes, disease, reduced availability of prey",
    "The Ladybug Tickler is a sex toy for human, not for ladybugs ;) Sorry ladybugs!",
    "A swarm of ladybugs is called a loveliness",
    "Like bears, ladybugs hibernate in the winter. The usually come together in large groups and sleep the winter away on mountains and areas of high elevation",
    "The children's rhyme \"Ladybug ladybug, fly away home. Your house is on fire, your children do roam\" was a reference to burning of hop vines in England that happened following the harvest, that cleared the fields and killed numerous ladybugs"
]