[
    "Ladybugs may eat their own eggs",
    "Female ladybugs lay as many as 1,000 tiny gold-colored eggs during a single season, but not all of the eggs make it to adulthood",
    "While they prefer to lay their eggs on leaves covered with aphids, when prey is in short supply, the ladybugs may eat the eggs and larvae",
    "Adult ladybugs have a recognizable smooth dome shape, and their forewings are protected by an outer shell, or elytra",
    "Underneath the outer shell of a ladybug is a pair of thin hind wings that unfold at a speed of 0.1 seconds and are significantly larger than the ladybug's body",
    "Ladybugs are very helpful to a garden as they eat aphids and mites, which are bugs that are harmful to plants",
    "One of the most common European ladybugs is the seven-spot ladybug, and its seven marks reminded people of the Virgin Mary's seven sorrows",
    "The English once called it a ladycow before they switched to bishop and ladybird.",
    "The twice-stabbed ladybug is black with just two bright red dots",
    "Ladybugs won't harm you unless you eat many pounds of them (or in the rare case that you're allergic to them)",
    "Ladybug pupae look like aliens",
    "In additiona to aphids, many ladybugs supplement their diets with pollen and other plant foods",
    "Ladybugs have turned up in parts of the world where they weren't previously found",
    "Ladybugs were brought over by people to combat agricultural pests",
    "Winemakers face a bizzare problem called Ladybug Taint. Ladybugs crawling on grapes squirt out a smelly defensive liquid during grape harvest if they're frightened",
    "Some species of ladybugs change color throughout the year",
    "The six short little legs of a ladybug help it to walk, but they do more than that. The feet of a ladybug helps it smell.",
    "Ladybugs have two pairs of wings, but only one pair is used to fly. The front wings are strong and protect the back wings. A ladybug's rear or back wings are its flying wings",
    "Birds are ladybugs' main predators, but they also fall victim to frogs, wasps, spiders, and dragonflies",
    "The scientific name for ladybug Coccinellidae septempunctata means \"seven spot ladybug\"",
    "The seven spotted ladybug has a black head with white spots on the side",
    "Yellow ladybugs are not all one species. You can tell the different types of yellow ladybug by the pattern of black spots on them",
    "Ladybugs live almost all over the world, except from in the north and south pole and the top part of North America and Russia where it is very cold",
    "When the ladybug takes flight, the hardened outer elytra open, and the thin inner veined wings unfold",
    "Millions of ladybugs gather in the southwestern United States, where they cover the ground like a blanket of red and black",
    "Once ladybug eggs hatch, the larvae eat about 350 to 400 aphids in the 2 weeks it takes them to become fully grown",
    "A ladybug's entire life cycle only takes three to seven weeks",
    "Ladybugs breathe through openings located at the sides of their bodies",
    "If you hold a Ladybug while making a wish, the direction that it flies away indicates where the answer to your wish will come from",
    "People believed that if a Ladybug with less than seven spots was seen, the harvest would be good for that season; if it had more than seven, there would be famine"
]