[
    "The more colorful a ladybug is, the more poisonous it is to its predators",
    "The seven spotted ladybug is native to Europe",
    "A ladybug lays its egg on a leaf. They are yellow eggs that turn white",
    "Ladybugs don't eat human food or chew on furniture",
    "One species, the harlequin ladybug, keeps toasty in winter by entering our homes",
    "In late summer, the ladybug gets ready for its winter dormancy period by dining on fruit, specifically ripe grapes",
    "Female ladybugs are larger than male ladybugs",
    "Ladybug's colorful domed backs are made of modified wings that are basically hardened armor",
    "Instead of heading south for the winter, ladybugs living in colder climates enter diapause, a type of insect hibernation",
    "A ladybug's bright color warns birds that it does not taste good",
    "A ladybug has two eyes but it doesn't see very well. Ladybugs can only see the difference between dark and light",
    "In Brussels, the number of spots on a Ladybug foretells how many children the person holding it will have",
    "Ladybugs taste and smell with their feet and antennae",
    "A popular Russian name for the ladybug is bozhya korovka, which translates to \"God's little cow.\"",
    "Ladybugs are omnivores they eat other small insects, fruit, aphids",
    "Ladybugs aren't preyed upon often, but some insects species like assassin bugs, stink bugs and spiders eat ladybugs",
    "Ladybugs aren't true bugs at all, they're beetles",
    "Many Bretons believe that the arrival of Ladybugs indicates fair weather",
    "Ladybugs are found worldwide except in cold places like Arctic, Antarctica",
    "The Harlequin Ladybug, an invader species, is native to East Asia but has spread to parts of Europe and North America",
    "Harlequin ladybugs like to over-winter in houses, and some houses are invaded each year by thousands of ladybugs",
    "Members of the ladybug family come in a wide range of hues, from ashy gray to dull brown to metallic blue",
    "Eggs or pupae also provide protein to a ladybug that has run out of aphids",
    "Ladybug patterns vary. Some have stripes, some have squiggles, and some have no patterns at all",
    "The fastest speed a ladybug can fly is 24 kilometers per hour, wow!",
    "Farmers use ladybugs to control other insects",
    "When a ladybug flies, its wings beat 85 times every second",
    "Some ladybugs have no spots and others have up to 20 spots",
    "If food is scarce, ladybugs will do what they must to survive, even if it means eating each other",
    "Broccoli, milkweed and other plants that attract aphids are where ladybugs tend to live. These beetles move on once they eat all the aphids on one plant",
    "The Harlequin ladybug, is the most common ladybug in North America. It is considered as a pest. So is Harley Quinn - a comic relief henchwoman for the supervillain Joker in Batman",
    "Scientists believe that ladybugs will deliberately lay infertile eggs as a ready source of food for their young hatchlings",
    "French people sometimes use the term vache à Dieu for a ladybug, which means \"cow of God.\"",
    "When times are tough, a ladybug may lay an increased number of infertile eggs to give her babies a better chance of surviving",
    "Not all ladybugs are red with black spots",
    "Certain Asian cultures believe that Ladybugs can understand human languages",
    "A Norse legend states that the Ladybug came to Earth riding on a bolt of lightening",
    "Ladybugs are most active when their body temperature is 75 degrees or warmer",
    "A ladybug will lay eggs in rows or clusters underneath a leaf",
    "Specialist ladybugs use a camouflage coloration to match the vegetation when they're in hibernation",
    "New data shows ladybugs can travel up to 120 kilometers (74 miles) in a single flight",
    "There are two sets of wings. The outer set is the hard shell for protection, and the inner set are what it uses to fly",
    "Former first of USA Lady Claudia Johnson, former president Lyndon B. Johnson's wife, is better known by her nickname \"Lady Bird\" Johnson",
    "The harlequin ladybug can be yellow, red, black, and almost any combination thereof, and it has any number of spots, from zero to 22",
    "The pupa sticks itself to a safe place where it will not move. The pupa breaks open as the ladybug comes out",
    "Among the spotted ladybugs, the number of spots varies",
    "The bold colors and simple shapes of a ladybug are used as a logo for a wide range of organisations and companies",
    "Ladybugs have \"hitchhiked\" on imported goods to parts of the world where they weren't previously found",
    "NASA sent a few ladybugs into space with aphids to see how aphids would escape in zero gravity",
    "You can tell where a ladybug lives based on its color patterns",
    "Because they blend in with the fruit, the ladybug gets harvested with the crop, and if the winemakers don't get rid of the ladybugs, the nasty taste of the \"knee bleed\" will taint the vintage",
    "The children's rhyme \"Ladybug ladybug, fly away home. Your house is on fire, your children do roam\" was a reference to burning of hop vines in England that happened following the harvest, that cleared the fields and killed numerous ladybugs",
    "As larvae, ladybugs resemble tiny black alligators",
    "Some ladybugs eat vegetation and fungi exclusively",
    "Once they are a certain size, the larvae of ladybugs stop eating and attach themselves to a plant leaf or stem",
    "In winter, Harlequin Ladybugs gather in huge numbers and settle into dark crevices in a house",
    "Near large bodies of water all over the world, massive numbers of ladybugs, dead and alive, occasionally or regularly appear on the shorelines",
    "Unlike you and I who chew up and down, ladybugs chew by moving their jaws side to side",
    "Ladybugs practice cannibalism",
    "There are 5,000 different species of ladybugs, 450 of which live in North America",
    "Ladybugs cluster together as a way to deter predators by increasing the concentration of their smell and their warning coloration.",
    "On average a ladybug lifespan is one year long",
    "The spots and bright colors on ladybugs are not for looks alone",
    "Most known ladybug is the red one with 7 spots however other species can have different numbers of spots",
    "Germans call ladybugs Marienkäfers, or Mary’s beetles",
    "Ladybugs with bright colors are walking billboards that say, \"Don't eat me. I'll make you sick.\"",
    "Ladybug populations are stable. Stable population refers to a population with an unchanging but possibly nonzero rate of growth",
    "Ladybug eyes are called compound eyes. They can see in lots of different directions at once",
    "The Ladybug Tickler is a sex toy for human, not for ladybugs ;) Sorry ladybugs!",
    "The maximum lifespan of a ladybug is two years",
    "Like bears, ladybugs hibernate in the winter. The usually come together in large groups and sleep the winter away on mountains and areas of high elevation",
    "Ladybugs gather together in large groups to diapause (the insect term for hibernation)",
    "The inner wings used for flying must dry before the ladybug can fly",
    "Legend has it farmers prayed to Virgin Mary for help when aphids were destroying their crops. Ladybugs arrived, ate all the aphids and saved the day. The farmers from then on referred to them as \"Our Lady's beetles.\"",
    "The Grouchy Ladybug is a children's book about an ill-mannered ladybug who thinks she's better than everybody",
    "An adult ladybug can eat up to 50 aphids in a day",
    "Ladybugs can survive for up to nine months by living off their stored reserves",
    "Orange and blue ladybugs are more exotic",
    "Four ladybugs were brought to space with aphids, so scientists could observe how predators and their prey would interact in zero gravity",
    "In Canada, a ladybug spending the winter in your garage is a sign of good luck for the garage owner and their family",
    "Many cultures consider ladybugs lucky and have nursery rhymes or local names for the insects that reflect this",
    "Some species of ladybug are spotted, others have stripes, and still others sport a checked pattern",
    "You can buy ladybugs like many gardeners do. Or you can mint a crypto-bug ! :)",
    "As cold-blooded species, ladybugs mainly are diurnal, utilizing as much sunlight as possible for feeding and mating",
    "The spots are meant to warn would-be attackers that this beetle tastes terrible",
    "Ladybugs have an exoskeleton made of a protein like the one that forms our hair and fingernails",
    "In most cultures a ladybug is known as a symbol of good luck",
    "Ladybugs may eat 5,000 aphids across its lifetime",
    "The Mexican bean beetle dines on beans, and the squash beetle eats squash, cantaloupe, and pumpkin",
    "The number of spots seen on a Ladybug indicates how many months it will be before one finds romance",
    "Much like butterflies, ladybugs go through four stages before they complete their metamorphosis",
    "It's not understood by the scientific community why ladybugs washup on shores",
    "Of the more than 6000 species of ladybug found on Earth, 166 of them are found in Canada, and more than 70 are found in Ontario",
    "In Norway, if a man and a woman see a Ladybug at the same time, romance will blossom between them",
    "The color of a ladybug's spots begin to fade as it gets older",
    "The species of ladybugs that eat pollen make sure there is enough left to pollinate the flower after it's done eating",
    "Ladybugs are both male and female. There are no gentleman bugs :P",
    "The larva sheds its outer skin, which is called molting. This happens after it has eaten too much that it's skin becomes too tight",
    "Ladybugs are a part of the largest group of pollinators",
    "In several languages, the portly, spotted ladybug is affectionately known as a little cow",
    "Ladybugs emit foul-smelling blood from their leg joints when they're startled",
    "The ladybug habitat is forests and grasslands, as well as in cities and suburbs, and near to rivers",
    "On the other hand, the yellow twenty-two spot ladybug has, well, 22 of them",
    "A hungry ladybug will make a meal of any soft-bodied sibling it encounters",
    "Some ladybugs have exotic colors as dark blue and orange",
    "Ladybug communicate with each other mainly through chemical signals (pheremones)",
    "In Belgium, it was believed that if a Ladybug crawled across a young woman's hand, she would be married within a year",
    "The ladybug's body goes from being soft with no spots to the hardened and spotted ladybugs we are familiar with",
    "Scientists used to believe that anything over 2 meters (7 feet) was a long-distance flight for a ladybug",
    "Ladybugs have two pairs of wings. The first pair of wings is the hardened elytra that protect the flight wings underneath",
    "Ladybugs are the official state insect of the following states in USA - Delaware, Massachusetts, New Hampshire, New York, Ohio and Tennessee",
    "Ladybugs break out of diapause, the insect term for hibernation, when the temperature reaches 55° F (13° C)",
    "Some ladybugs have white spots and some even have stripes",
    "A ladybug's jaws chew from side to side instead of up and down like our jaws",
    "When all else fails, ladybugs are known to play dead, giving them a third defense mechanism in a world of eat or be eaten",
    "In 1999, four appropriately named ladybugs, John, Paul, Ringo, and George (after The Beatles of course) went to space",
    "In Ireland, the ladybug is said to be a symbol of protection",
    "In Sweden, if a ladybug lands on a young girl's hand, she will soon be getting married",
    "The Harlequin Ladybug, an invader species, pushes out native species, infects them with a deadly fungal parasite, and even eats them",
    "Ladybugs mature from their larval form to adults in about a week",
    "Despite its name, there are both male and female ladybugs",
    "The twice stabbed ladybug is black and has two big red spots",
    "Newly emerged adults or recently molted larvae are soft enough for the average ladybug to chew",
    "People in France believed that if a Ladybug landed on someone, it would take away whatever ailment the person had when it flew away",
    "In Switzerland, the Ladybug is the baby-deliverer (just as the stork is in the US)",
    "Ladybugs eat a tremendous amount of insects",
    "After the larva is done molting, it becomes a pupa",
    "Ladybugs are, and have been for very many years, an insect of interest and favour for children",
    "Legend says that if you find a Ladybug in your house, count the number of spots it has and that will be how many dollars you will find",
    "Once unfolded, ladybug wings move at a rate of 85 beats per second",
    "Ladybugs are universally beloved, and one reason is that they're a natural and adorable form of pest control",
    "A swarm of ladybugs is called a loveliness",
    "Four stages exist in the ladybug life cycle, a process known as complete metamorphosis",
    "A common myth is that the number of spots on the insect's back indicates its age",
    "Ladybug taint is a particular stinky flavor to wine, that has been likened to peanuts or asparagus",
    "For some species of ladybugs, their diet consists of 50% pollen",
    "A detailed study has shown ladybugs travelling at heights in excess of 1,100 meters (3,600 feet) and reaching speeds of 60 kilometers per hour (37 mile per hour)",
    "As they grow, the larvae shed their skin several times",
    "Ladybugs squirt out a noxious defensive liquid that can stain light surfaces",
    "One of the primary differences between beetles and bugs is that beetles have chewing mouthparts, but bugs have mouthparts modified into a piercing stylet like a needle",
    "A ladybug beats its wings about 5100 times a minute or about 85 beats a second when it flies",
    "Sometimes masses of ladybugs wash up on shores",
    "In winter, ladybugs enter a state of rest and cuddle together in groups, often in logs or under leaves",
    "Male ladybugs are typically smaller in size compared to the female",
    "Insect-eating birds and other animals learn to avoid meals that come in red and black and are more likely to steer clear of a ladybug lunch",
    "Ladybugs range in size from 0.8 to 18 millimeters (0.0315 to 0.708 inches)",
    "Ladybugs' numbers are declining. :( Some reasons are climate change, land-use changes, disease, reduced availability of prey",
    "The North American ladybug is not endangered yet, but its overall numbers have decreased, and some scientists believe that is the result of harlequin competition",
    "Ladybugs grow up to one centimetre long",
    "In folk medicine, Ladybugs were ground up to cure toothaches, measles, stomach aches, and crying babies",
    "Male ladybugs have hair on their abdomens and bands in between their segments",
    "Most ladybugs are oval shaped",
    "In the pupa stage of a ladybug's metamorphosis, they attach themselves to a plant leaf or stem",
    "In 1888, an Australian ladybug was imported in California for a pest control experiment. The experiment helped triple California's orange crop",
    "There are almost 400 different kinds of ladybugs in North America",
    "In 2017, a film entitled Lady Bird starring Saoirse Ronan and directed by Greta Gerwig released in U.S. cinemas",
    "Though ladybug larvae may be intimidating, they're not harmful to humans",
    "Ladybugs have hidden wings underneath their outer shell",
    "In England, finding a ladybug means there will be a good harvest",
    "In parts of England, the ladybug is a bishop. Local variants of this name abound, including the amazing bishy bishy barnabee",
    "The largest washup of ladybugs on a shore to date happened in the early 1940s when an estimated 4.5 billion individuals were spread over 21 kilometers of shoreline in Libya",
    "In an effort to track ladybug populations, entomologists at Cornell University created the Lost Ladybug Project, a citizen-based effort to spot, photograph, and report on ladybugs across North America",
    "Ladybugs begin as tiny eggs that hatch into larvae that resemble tiny spiny alligators",
    "In additiona to aphids, many ladybugs supplement their diets with pollen and other plant foods",
    "Yellow ladybugs are not all one species. You can tell the different types of yellow ladybug by the pattern of black spots on them",
    "The seven spotted ladybug has a black head with white spots on the side",
    "Birds are ladybugs' main predators, but they also fall victim to frogs, wasps, spiders, and dragonflies",
    "The six short little legs of a ladybug help it to walk, but they do more than that. The feet of a ladybug helps it smell."
]