[
    "Ladybug ladybug, a bird's hunting game. Ladybird beetle is your name!!",
    "Snug as a bug in a rug",
    "Scent of damask roses upon the air, ladybug landing",
    "There's a lady who's sure all that glitters is gold, and she's bugging a stairway to heaven",
    "I'm sending luck and wishes all wrapped up in a hug. Good things should come your way with this tiny ladybug.",
    "\"Don't bug the bug lady cuz the ladybug gonna bug you\" - Unknown",
    "Yes, I am the crazy ladybug lady",
    "On a day like this, I'd rather be catching ladybugs!",
    "Let your imagination... fly like the lady-bird, north, south, east and west, but take care that it always comes home to rest.",
    "I'm a ladybug, in a lady world! Life is spotted, it's fantastic. You can see me crawl, I go everywhere! Imagination, life is your creation!",
    "What do two ladybugs do in the gym? They spot each other!",
    "Red is the first color of spring. It's the real color of rebirth—of beginning.",
    "Sometimes the smallest of us are the bravest of all.",
    "Lady hear my tonight! Cuz my feeling is just so right!",
    "Spots on! Claws out! That's what life is all about",
    "Ladybug ladybug, fly out of the bed, and land right on my little head!",
    "Oh so lovely that a swarm of ladybugs is called a loveliness",
    "Ladybug ladybug, you have six legs and you lay sticky yellow eggs",
    "I am rather fond of ladybugs. They are so delightfully hemispherical",
    "I didn't choose the bug life. The bug life chose me.",
    "🎵Lady you are beautiful beautiful beautiful!🎵",
    "I'm red with polka dots and my name is Classy. I'm a tickle bug who's silly and sassy",
    "The ladybug lights the way. She brings magic to my day.",
    "Everyone does have a past they can learn from",
    "Please don't bug the lady.",
    "Spot the differences is not a game played with ladybugs",
    "Ladybug in the garden fair, carried home in a matchbox square, ladybug my spotted friend",
    "When you encounter the ladybug spirit animal at any point, you can be sure that positive transformations are on the way",
    "All the single ladies, all the spotted ladies! If you liked it then you shoulda put your ETH on it",
    "A good gardener always plants in threes, one for the bugs, one for the weather, and one for herself",
    "What do you call a male ladybug? A m'ladybug!",
    "Little red bug, oh so cute, here's a black spot for your suit",
    "It's going to be a buggy ride",
    "Ladybug ladybug, fly out of the rose, and land right on my little nose!",
    "In a dress like yours, that is red with black spots, let me dance on flower tops",
    "Ladybug ladybug, fly out of the tree, and land right on my little knee!",
    "Our greatest glory is not in never failing, but in rising everytime we fail",
    "I'm a ladybug with really rosy cheeks. I love to tickle, when a silly kid speaks",
    "The truth of the matter is this, Ladybug is the girl who he wants to kiss",
    "Throw like a ladybug, scratch like a cat!",
    "Oh ladybug, I wish you joy as you complete your garden chores. I'd like to put aside my work and join you in the out-of-doors!",
    "Appreciate the little things. There are so many",
    "You'll look back one day and realize that the little things in life were really the big things",
    "Ladybugs all dressed in red, strolling through the flower bed. If I were tiny just like you, I'd creep among the flowers too!",
    "Ladybug ladybug, in a hollow tree. Through the winter, under the leaves you will be",
    "With a butterfly kiss and a ladybug hug, sleep tight little one like a bug in a rug.",
    "Little things make big days",
    "Life of a bug. Born, flew, and got killed and no one witnessed",
    "\"When I find a ladybug, I ask the butler to take it outside instead of killing it.\" – Winston Churchill",
    "Why don't ladybugs play hide and seek? They always get spotted!",
    "Ladybug: Bugging you is easy cuz you're buggable",
    "Ladybug: Don't you wish your girlfriend was hot like me",
    "Hurt no living thing — ladybird, nor butterfly, nor moth with dusty wings.",
    "Time sneaks up on you like a windshield on a bug",
    "Ladybugs are all dressed in red. Strolling through the flower bed. If I were tiny just like you. I'd creep through the flowers too!",
    "Oh lovely ladybug, take me to a place so fair, where I do not have a care",
    "This lucky little ladybug has landed here to stay—to make my garden pretty and keep the weeds away",
    "Ladybug ladybug, with antennae you can smell. Under your hard wings are clear ones as well",
    "How many ladybugs does it take to screw in a light bulb? Two, but don't ask me how they got in there.",
    "Don't ladybug me until I have had my coffee"
]