[
    "Until you spread your wings you'll have no idea how far you can fly",
    "Appreciate the little things. There are so many",
    "Life of a bug. Born, flew, and got killed and no one witnessed",
    "Spread your wings and fly, you don't know what is possible until you try",
    "I am rather fond of ladybugs. They are so delightfully hemispherical.",
    "Time sneaks up on you like a windshield on a bug",
    "Some days you are the bug, some days you are the windshield",
    "\"Never hurt a ladybug. We need them in the garden. Ladybugs help flowers grow, so we must give them pardon!\"",
    "Why don't ladybugs play hide and seek? They always get spotted!",
    "This lucky little ladybug has landed here to stay—to make my garden pretty and keep the weeds away",
    "You'll look back one day and realize that the little things in life were really the big things",
    "Ladybug: Bugging you is easy cuz you're buggable",
    "How brave a ladybug must be! Each drop of rain is big as she. Can you imagine what you'd do, if raindrops fell as big as you?",
    "Here's our loveliness, spreading joy!",
    "Hello, world! Have a bugnificient day!",
    "Float like a butterfly, sting like a bee, but love like a ladybug and live gracefully!",
    "With a butterfly kiss and a ladybug hug, sleep tight little one like a bug in a rug.",
    "Hurt no living thing — ladybird, nor butterfly, nor moth with dusty wings.",
    "Little lady little bug, crawling up my little thumb",
    "Ladybugs all dressed in red, strolling through the flower bed. If I were tiny just like you, I'd creep among the flowers too!",
    "Ladybug, ladybug, make me a match! 💙",
    "You can't have a bad day in polka dots.",
    "To the window, to the wall, till the L'bug crawls across 😎",
    "Oh ladybug, I wish you joy as you complete your garden chores. I'd like to put aside my work and join you in the out-of-doors!",
    "Ladybug: Don't you wish your girlfriend was hot like me",
    "Pretty little ladybug, don't get frightened and lose your gunk",
    "Under the new decree by The Lady Bug, dalmatians will henceforth be called ladybug dogs!",
    "Keep calm and bugger off 😌",
    "\"When I find a ladybug, I ask the butler to take it outside instead of killing it.\" – Winston Churchill",
    "Little ladybug on my arm, you wear a heart as part of your charm. You joined me on this sunny day, just for a moment, then you flew away",
    "You can take the bug out of the lady but you can't take the lady out of the ladybug",
    "When in doubt, wear red with black spots",
    "Ladybug! Call me Ladybug.",
    "Little things make big days",
    "Every struggle has a sacrifice behind it",
    "Oh lovely ladybug, take me to a place so fair, where I do not have a care",
    "How many ladybugs does it take to screw in a light bulb? Two, but don't ask me how they got in there.",
    "Ladybug ladybug, orange yellow and red. You have seven spots and a tiny head",
    "Ladybug ladybug, hatching in a week. Fifty aphids in a day, you will eat!",
    "Ladybug ladybug, with antennae you can smell. Under your hard wings are clear ones as well",
    "Ladybug ladybug, in a hollow tree. Through the winter, under the leaves you will be",
    "Ladybugs are all dressed in red. Strolling through the flower bed. If I were tiny just like you. I'd creep through the flowers too!",
    "Ladybug ladybug, how are you today? Ladybug ladybug, are you going to stay? Ladybug ladybug, or will you fly away?",
    "The truth of the matter is this, Ladybug is the girl who he wants to kiss",
    "Whoever said that life was fair, most certainly had ladybugs happen their way!",
    "Ladybugs centers around good fortune, true love, innocence, needing to make the right choices in life and happy resolutions.",
    "Ladybug ladybug, fly out of the farm, and land right on my little arm!",
    "Don't ladybug me until I have had my coffee",
    "People should just go out into the garden and watch a ladybug crawl across a flower and relax their mind. That's about all you need to know about life.",
    "Throw like a ladybug, scratch like a cat!",
    "The Ladybug wears no disguises. She is just what she advertises",
    "The ladybug has to be the most feminist of insects. Even the male bugs are called ladybugs!"
]